blog/2017/03/14/word-list-20170314/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
    <title>Word List 20170314 (The five-year plan: Command performance) - Sean Wang&#39;s Notebook</title>
    <meta charset="utf-8" />
    <meta name="author" content="Sean Wang" />
    <meta name="description" content="word list" />
    <meta name="keywords" content="translation" />
    <link rel="stylesheet" href="/media/css/main.css" type="text/css">
    <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
  </head>
  <body class="container">
    <div>
      <header class="masthead">
        <h1 class="masthead-title"><a href="/">Sean Wang&#39;s Notebook</a></h1>
        <p>Happy Hacking</p>
        <ul>
          <li><a href="/blog/">Blog</a></li>
          <li><a href="/english/">English</a></li>
          <li><a href="/notes/">Notes</a></li>
          <li><a href="/translation/">Translation</a></li>
          <li><a href="/tags/">Tags</a></li>
          <li><a href="/about/">About</a></li>
          <li><a href="https://github.com/SparkWang">GitHub</a></li>
          <li><a href="/rss.xml">RSS</a></li>
        </ul>
        <form method="get" id="searchform" action="//www.google.com/search">
          <input type="text" class="field" name="q" id="s" placeholder="Search">
          <input type="hidden" name="as_sitesearch" value="spark.wangxing.name">
        </form>
      </header>
    </div>

<div>
<div class="post">
<h1>Word List 20170314 (The five-year plan: Command performance)</h1>
<dl class="org-dl">
<dt> <i>command performance</i> </dt><dd>a special performance of a play or film which is
given because a royal or very important person has requested it, 奉命专场演出；御前演出
</dd>
<dt> <i>take your cue from sb</i> </dt><dd>to copy what sb else does as an example of how to
behave or what to do, 模仿…的样子做；学…的样
</dd>
<dt> <i>chart</i> </dt><dd>to plan a course of action, 计划行动步骤；制订计划:
<ul class="org-ul">
<li><i>e.g.</i>, She had carefully charted her route to the top of her profession. 她周密地制订了达到她职业巅峰的行动计划。
</li>
</ul>
</dd>
<dt> <i>course</i> </dt><dd>the general direction in which sb's ideas or actions are moving,
方针；行动方向
</dd>
<dt> <i>then-agrarian</i> </dt><dd>当时还是农业的
<ul class="org-ul">
<li><i>agrarian</i>, connected with farming and the use of land for farming, 农业的；土地的；耕地的
</li>
<li><i>e.g.</i>, ...a rich area with a highly developed agrarian economy. 农耕经济高度发达的富饶地区
</li>
</ul>
</dd>
<dt> <i>message</i> </dt><dd>an important moral, social or political idea that a book, speech,
etc. is trying to communicate,（书籍、演讲等的）要旨，要点，教训
</dd>
<dt> <i>run its course</i> </dt><dd>develop in the usual way and reach a natural end, 遵循进程；听其发展；采用（某种）方法听其自然
</dd>
<dt> <i>indicative</i> </dt><dd>(of sth) (formal) showing or suggesting sth 表明；标示；显示；暗示
<ul class="org-ul">
<li><i>e.g.</i>, Their failure to act is indicative of their lack of interest. 他们未采取行动，这表示他们没有兴趣。
</li>
</ul>
</dd>
<dt> <i>hallmark</i> </dt><dd>The hallmark of something or someone is their most typical quality
or feature. 可数名词, 标志;特征;特点
</dd>
<dt> <i>astray</i> </dt><dd>to go in the wrong direction or to have the wrong result 走错方向；误入歧途
</dd>
<dt> <i>slavishly</i> </dt><dd>obeying completely; without any ideas of your own 俯首贴耳地，盲从地
<ul class="org-ul">
<li><i>e.g.</i>, I followed the recipe slavishly.我乖乖按照那份食谱做饭。
</li>
</ul>
</dd>
<dt> <i>neon</i> </dt><dd>Neon lights or signs are made from glass tubes filled with neon gas
which produce a bright electric light. 形容词, 霓虹的
</dd>
<dt> <i>think-tank</i> </dt><dd>智囊团，智库. A think-tank is a group of experts who are
gathered together by an organization, especially by a government, in order to
consider various problems and try and work out ways to solve them.
<ul class="org-ul">
<li><i>e.g.</i>, ...Moscow's leading foreign policy think-tank. 莫斯科首要的外交政策智囊团
</li>
</ul>
</dd>
<dt> <i>scurry</i> </dt><dd>to run with quick short steps 碎步疾跑
</dd>
<dt> <i>rhetoric</i> </dt><dd>speech or writing that is intended to influence people, but that
is not completely honest or sincere 华而不实的言语；花言巧语
<ul class="org-ul">
<li><i>e.g.</i>, the rhetoric of political slogans, 政治口号的虚华辞藻
</li>
</ul>
</dd>
<dt> <i>direct</i> </dt><dd>to aim sth in a particular direction or at a particular person 把…对准（某方向或某人）
</dd>
<dt> <i>capital</i> </dt><dd>a large amount of money that is invested or is used to start a
business 资本；资金；启动资金
</dd>
<dt> <i>binding</i> </dt><dd>~ (on / upon sb) that must be obeyed because it is accepted in law,
必须遵守的；有法律约束力的:
</dd>
<dt> <i>obliged</i> </dt><dd>to be or feel, etc. forced to do something or that you must do
something 被迫做某事；必须做某事；只好做某事
</dd>
<dt> <i>albeit</i> </dt><dd>although 尽管；虽然。 连词
</dd>
<dt> <i>fiddle</i> </dt><dd>to change the details or figures of sth in order to try to get money
dishonestly, or gain an advantage, 篡改；伪造；对…做手脚
<ul class="org-ul">
<li><i>e.g.</i>, to fiddle the accounts, 篡改账目
</li>
</ul>
</dd>
<dt> <i>mandatory</i> </dt><dd>~ (for sb) (to do sth) (formal) required by law 强制的；法定的；义务的
</dd>
<dt> <i>for all that</i> </dt><dd>in spite of the fact that : ALTHOUGH
<ul class="org-ul">
<li><i>e.g.</i>, I don't trust him, for all that so many people consider him
reliable. 尽管很多人认为他可靠，但我并不信任他。
</li>
</ul>
</dd>
<dt> <i>slip</i> </dt><dd>to fall to a lower level; to become worse 下降；退步；变差
<ul class="org-ul">
<li><i>e.g.</i>, His popularity has slipped recently. 近来他已不如过去那样受欢迎。
</li>
</ul>
</dd>
<dt> <i>doctor</i> </dt><dd>to change sth in order to trick sb 篡改；伪造
<ul class="org-ul">
<li><i>e.g.</i>, He was accused of doctoring the figures. 他被指控篡改数字。
</li>
</ul>
</dd>
<dt> <i>abiding</i> </dt><dd>lasting for a long time and not changing 持久的；长久的；始终不渝的
</dd>
<dt> <i>cynicism</i> </dt><dd>Cynicism about something is the belief that it cannot be
successful or that the people involved are not honourable. (对成功或人的真善的）怀疑. 不可数名词
<ul class="org-ul">
<li><i>e.g.</i>, This talk betrays a certain cynicism about free trade. 这番讲话流露出一种对自由贸易不看好的态度。
</li>
</ul>
</dd>
<dt> <i>lodestar</i> </dt><dd>北极星. (formal) a principle that guides sb's behaviour or actions
（某人行为或行动的）指导原则
</dd>
<dt> <i>pledge</i> </dt><dd>(to do sth) a serious promise 保证；诺言；誓约
<ul class="org-ul">
<li><i>e.g.</i>, Will the government honour its election pledge not to raise taxes?
政府会履行它的竞选诺言，不增加税收吗？
</li>
</ul>
</dd>
<dt> <i>welfare payments</i> </dt><dd>福利金
</dd>
<dt> <i>abolish</i> </dt><dd>to officially end a law, a system or an institution 废除，废止（法律、制度、习俗等）
</dd>
<dt> <i>emission</i> </dt><dd>(formal) the production or sending out of light, heat, gas, etc.
（光、热、气等的）发出，射出，排放
<ul class="org-ul">
<li><i>e.g.</i>, the emission of carbon dioxide into the atmosphere, 向大气排放二氧化碳
</li>
</ul>
</dd>
<dt> <i>megacity</i> </dt><dd>A very large city
</dd>
<dt> <i>intriguing</i> </dt><dd>very interesting because of being unusual or not having an
obvious answer 非常有趣的；引人入胜的；神秘的
<ul class="org-ul">
<li><i>e.g.</i>, an intriguing possibility , 令人不解的可能性
</li>
</ul>
</dd>
<dt> <i>historic</i> </dt><dd>important in history; likely to be thought of as important at some
time in the future 历史上著名（或重要）的；可名垂青史的
</dd>
<dt> <i>cherished</i> </dt><dd>to keep an idea, a hope or a pleasant feeling in your mind for a
long time 抱有（信念、希望）；怀有（好感）；怀念
</dd>
<dt> <i>collapse</i> </dt><dd>to fail suddenly or completely 突然失败；崩溃；瓦解
</dd>
<dt> <i>beat</i> </dt><dd>to defeat sb in a game or competition（在比赛或竞争中）赢，打败（某人）
</dd>
<dt> <i>incentive</i> </dt><dd>名词，something that encourages you to do sth 激励；刺激；鼓励
</dd>
</dl>

</div>
</div>
    <div>
      <div class="post-meta">
        <span title="post date" class="post-info">2017-03-14</span>
        <span title="last modification date" class="post-info">2017-08-01</span>
        <span title="tags" class="post-info"><a href="/tags/te/">TE</a></span>
        <span title="author" class="post-info">Sean Wang</span>
      </div>
      <section>
        <h1>Comments</h1>
      </section>
      <script src="//code.jquery.com/jquery-latest.min.js"></script>
      <script src="https://cdnjs.cloudflare.com/ajax/libs/prettify/r298/prettify.js"></script>
      <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
      <script src="/media/js/main.js"></script>
      <div class="footer">
        <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.x (<a href="http://orgmode.org">Org mode</a> 8.x)</p>
        <p>
          Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:spark &lt;at&gt; bjtu &lt;dot&gt; edu &lt;dot&gt; cn">Sean Wang</a>
          &nbsp;&nbsp;-&nbsp;&nbsp;
          Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
          <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
        </p>
      </div>
    </div>

  </body>
</html>
